Updated flow chart for unigate service layers
